slorquet/slos/board/stm32f103-minimum/src/board_start.c
#include <stdint.h>

#include "stm32f1_rcc.h"
#include "stm32f1_gpio.h"
#include "stm32f1_uart.h"

#define PC13 (GPIO_PORT_C | GPIO_PIN_13)

void board_start(void)
{
  uint32_t state = 1;
  volatile int i;
  bool succ;

  /* configure pc13 as output to blink the led */
  stm32f1_gpio_init(PC13 | GPIO_MODE_OUT | GPIO_TYPE_PP | GPIO_SPEED_LOW | GPIO_STATE_CLEAR);

  /* Test UART */
  kprintf("Hello %s!\n\n", "world");
  kprintf("hex   = %x\n", 0xA42B);
  kprintf("HEX   = %X\n", 0xA42B);
  kprintf("sdecp = %d\n", 12345);
  kprintf("sdecp = %d\n", 42);
  kprintf("snegn = %d\n", -42);
  kprintf("udecp = %u\n", 42);
  kprintf("unegn = %u\n", -42);
  kprintf("ptr   = %p\n", &state);

  kprintf("Enable LSE\n");
  succ = stm32f1_clock_enablelse();
  if(succ)
    kprintf("LSE status OK\n");
  else
    kprintf("LSE status Fail\n");

  /* Loop blinking led */

  while(1)
    {
      stm32f1_gpio_write(PC13, state);
      state = !state;
      for(i=0;i<100000;i++) {};
    }
}
